*** src/bin/yalda-gpui/agent.rs:3670:25: replace || with && in AgentState::settle_input_focus

*** mutation diff:
--- src/bin/yalda-gpui/agent.rs
+++ replace || with && in AgentState::settle_input_focus
@@ -3662,17 +3662,17 @@
     pub(crate) fn settle_input_focus(&mut self) {
         // A FRESH worksheet (empty transcript) has nothing to navigate, so it must
         // show an input immediately — open a tail block (the "I don't see anything
         // on a new session" bug). Likewise a non-empty restored draft.
         let fresh = self.editor.document().is_empty();
         if self.input_surface.is_chatbox() {
             self.close_you_block();
             self.focus = AgentFocus::Compose;
-        } else if fresh || !self.input_surface.compose().text().trim().is_empty() {
+        } else if fresh && /* ~ changed by cargo-mutants ~ */ !self.input_surface.compose().text().trim().is_empty() {
             // Open a VISIBLE tail block (so a fresh/cleared worksheet shows an input
             // and a restored draft shows), but REST IN NAV (focus=Transcript), not
             // Insert: the leaders (`space`/`.`/`?`) must open the tile menu when a
             // tile is focused, and they only fire outside text entry. The user
             // presses `i` to type. (Auto-focusing Insert here regressed the tile
             // menu — runtime report.)
             self.you_block_open = true;
             self.you_block_anchor = None; // tail

---- tests::clear_then_empty_channel_open_keeps_worksheet_typeable stdout ----

thread 'tests::clear_then_empty_channel_open_keeps_worksheet_typeable' (163315480) panicked at src/bin/yalda-gpui/tests.rs:2975:5:
clear settles a typeable worksheet block

---- tests::clear_resets_worksheet_to_a_visible_nav_block stdout ----

thread 'tests::clear_resets_worksheet_to_a_visible_nav_block' (163315479) panicked at src/bin/yalda-gpui/tests.rs:142:5:
clear opens a VISIBLE tail You-block

---- verify_harness::fresh_worksheet_session_shows_an_input stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::fresh_worksheet_session_shows_an_input' (163315690) panicked at src/bin/yalda-gpui/verify_harness.rs:5916:9:
a fresh session opens a VISIBLE tail input block

failures:
    tests::clear_resets_worksheet_to_a_visible_nav_block
    tests::clear_then_empty_channel_open_keeps_worksheet_typeable
    verify_harness::fresh_worksheet_session_shows_an_input
    verify_harness::worksheet_replay_reopens_tail_block_stale_safe

test result: FAILED. 306 passed; 4 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.47s

*** result: Failure(101)
