*** src/bin/yalda-gpui/agent.rs:3670:28: delete ! in AgentState::settle_input_focus

*** mutation diff:
--- src/bin/yalda-gpui/agent.rs
+++ delete ! in AgentState::settle_input_focus
@@ -3662,17 +3662,17 @@
     pub(crate) fn settle_input_focus(&mut self) {
         // A FRESH worksheet (empty transcript) has nothing to navigate, so it must
         // show an input immediately — open a tail block (the "I don't see anything
         // on a new session" bug). Likewise a non-empty restored draft.
         let fresh = self.editor.document().is_empty();
         if self.input_surface.is_chatbox() {
             self.close_you_block();
             self.focus = AgentFocus::Compose;
-        } else if fresh || !self.input_surface.compose().text().trim().is_empty() {
+        } else if fresh ||  /* ~ changed by cargo-mutants ~ */self.input_surface.compose().text().trim().is_empty() {
             // Open a VISIBLE tail block (so a fresh/cleared worksheet shows an input
             // and a restored draft shows), but REST IN NAV (focus=Transcript), not
             // Insert: the leaders (`space`/`.`/`?`) must open the tile menu when a
             // tile is focused, and they only fire outside text entry. The user
             // presses `i` to type. (Auto-focusing Insert here regressed the tile
             // menu — runtime report.)
             self.you_block_open = true;
             self.you_block_anchor = None; // tail

---- verify_harness::worksheet_restore_settles_focus_and_block stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::worksheet_restore_settles_focus_and_block' (163323572) panicked at src/bin/yalda-gpui/verify_harness.rs:5991:9:
with content + empty draft, rest in nav

failures:
    verify_harness::worksheet_restore_settles_focus_and_block

test result: FAILED. 309 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.57s

*** result: Failure(101)
