*** src/bin/yalda-gpui/agent.rs:3933:29: replace && with || in AgentState::inline_you_block_active

*** mutation diff:
--- src/bin/yalda-gpui/agent.rs
+++ replace && with || in AgentState::inline_you_block_active
@@ -3925,17 +3925,17 @@
     /// agent is idle, and we're in the worksheet (mid-turn the draft is the bottom
     /// chatbox, not an inline block; chatbox mode never has an inline block). This
     /// is the ONE predicate the render injection (`rebuild_agent_view_model`), the
     /// transcript fingerprint + snapshot (`TranscriptSeqs`/`YouBlockSnap`), the
     /// inline-edit session-notify, and the submit-anchor path all share — keeping
     /// them from drifting out of sync (which would re-introduce the stale/double
     /// render class).
     pub(crate) fn inline_you_block_active(&self) -> bool {
-        self.you_block_open && !self.turn_phase.is_awaiting() && !self.input_surface.is_chatbox()
+        self.you_block_open || /* ~ changed by cargo-mutants ~ */ !self.turn_phase.is_awaiting() && !self.input_surface.is_chatbox()
     }
 
     /// The You-block anchor to ACTUALLY use, re-validated against the CURRENT
     /// transcript. A stored anchor can go stale (toggle round-trip, streaming,
     /// replay, finalize moving the cursor) and point into old history; returning
     /// `None` there makes every consumer fall back to the tail (EOF append /
     /// tail render) instead of burying the reply mid-history (bug-hunt 1,2,7,8).
     pub(crate) fn effective_you_block_anchor(&self) -> Option<usize> {

*** result: Success
