*** src/bin/yalda-gpui/agent.rs:3933:66: delete ! in AgentState::inline_you_block_active

*** mutation diff:
--- src/bin/yalda-gpui/agent.rs
+++ delete ! in AgentState::inline_you_block_active
@@ -3925,17 +3925,17 @@
     /// agent is idle, and we're in the worksheet (mid-turn the draft is the bottom
     /// chatbox, not an inline block; chatbox mode never has an inline block). This
     /// is the ONE predicate the render injection (`rebuild_agent_view_model`), the
     /// transcript fingerprint + snapshot (`TranscriptSeqs`/`YouBlockSnap`), the
     /// inline-edit session-notify, and the submit-anchor path all share — keeping
     /// them from drifting out of sync (which would re-introduce the stale/double
     /// render class).
     pub(crate) fn inline_you_block_active(&self) -> bool {
-        self.you_block_open && !self.turn_phase.is_awaiting() && !self.input_surface.is_chatbox()
+        self.you_block_open && !self.turn_phase.is_awaiting() &&  /* ~ changed by cargo-mutants ~ */self.input_surface.is_chatbox()
     }
 
     /// The You-block anchor to ACTUALLY use, re-validated against the CURRENT
     /// transcript. A stored anchor can go stale (toggle round-trip, streaming,
     /// replay, finalize moving the cursor) and point into old history; returning
     /// `None` there makes every consumer fall back to the tail (EOF append /
     /// tail render) instead of burying the reply mid-history (bug-hunt 1,2,7,8).
     pub(crate) fn effective_you_block_anchor(&self) -> Option<usize> {

---- tests::clear_then_empty_channel_open_keeps_worksheet_typeable stdout ----

thread 'tests::clear_then_empty_channel_open_keeps_worksheet_typeable' (163358422) panicked at src/bin/yalda-gpui/tests.rs:2975:5:
clear settles a typeable worksheet block

---- verify_harness::agent_tile_statemachine_fuzz_holds_invariants stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::agent_tile_statemachine_fuzz_holds_invariants' (163358565) panicked at src/bin/yalda-gpui/verify_harness.rs:6431:5:
turn_phase stop⇒awaiting, You-block⇒worksheet, effective-anchor legal [seed=1 step=0 op=11]

---- verify_harness::fresh_worksheet_session_shows_an_input stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::fresh_worksheet_session_shows_an_input' (163358616) panicked at src/bin/yalda-gpui/verify_harness.rs:5917:9:
the input is visible

failures:
    tests::clear_then_empty_channel_open_keeps_worksheet_typeable
    verify_harness::agent_tile_statemachine_fuzz_holds_invariants
    verify_harness::fresh_worksheet_session_shows_an_input
    verify_harness::toggle_agent_focus_round_trips
    verify_harness::worksheet_block_normal_then_insert_again
    verify_harness::worksheet_compose_visibility_tracks_block_and_turn
    verify_harness::worksheet_focus_toggle_opens_visible_block
    verify_harness::worksheet_inline_typing_rerenders_transcript
    verify_harness::worksheet_renders_flush_chatbox_renders_boxed
    verify_harness::worksheet_replay_reopens_tail_block_stale_safe
    verify_harness::worksheet_restore_settles_focus_and_block
    verify_harness::worksheet_tall_inline_block_keeps_caret_in_window

test result: FAILED. 298 passed; 12 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.89s

*** result: Failure(101)
