*** src/bin/yalda-gpui/main.rs:3611:9: replace YaldaGpuiView::try_start_mark_chord -> bool with true

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ replace YaldaGpuiView::try_start_mark_chord -> bool with true
@@ -3603,32 +3603,17 @@
     /// Check if a bare key press starts a mark chord (`m` or `'`).
     /// Returns true if the key was consumed.
     fn try_start_mark_chord(
         &mut self,
         key: &Key,
         modifiers: &KMods,
         cx: &mut Context<Self>,
     ) -> bool {
-        if !modifiers.is_empty() {
-            return false;
-        }
-        match key {
-            Key::Char('m') => {
-                self.pending_mark_chord = Some('m');
-                cx.notify();
-                true
-            }
-            Key::Char('\'') => {
-                self.pending_mark_chord = Some('\'');
-                cx.notify();
-                true
-            }
-            _ => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// `on_key_down` handler for the Doc view — intercepts bare `m`/`'` to
     /// start a mark chord.
     fn handle_doc_key(&mut self, ev: &KeyDownEvent, _w: &mut Window, cx: &mut Context<Self>) {
         let press = keystroke_to_keypress(&ev.keystroke);
 
         // Universal leaders: the doc view is never text entry, so `<space>`/`.`/

---- verify_harness::m_is_typeable_in_compose stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::m_is_typeable_in_compose' (163198862) panicked at src/bin/yalda-gpui/verify_harness.rs:5519:9:
assertion `left == right` failed: m types in the compose (Insert), not eaten by a mark chord
  left: ""
 right: "map"
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

---- verify_harness::real_midturn_worksheet_m_types_not_marks stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::real_midturn_worksheet_m_types_not_marks' (163198871) panicked at src/bin/yalda-gpui/verify_harness.rs:5132:9:
assertion `left == right` failed: idle transcript nav: bare `m` starts a mark chord
  left: None
 right: Some('m')
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

---- verify_harness::real_midturn_worksheet_empty_draft_space_opens_menu stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::real_midturn_worksheet_empty_draft_space_opens_menu' (163198870) panicked at src/bin/yalda-gpui/verify_harness.rs:5171:9:
assertion failed: v.read_session(id, cx, |c| c.turn_phase.is_awaiting()).unwrap()
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

failures:
    verify_harness::m_is_typeable_in_compose
    verify_harness::real_midturn_worksheet_empty_draft_space_opens_menu
    verify_harness::real_midturn_worksheet_m_types_not_marks
    verify_harness::real_midturn_worksheet_typed_draft_space_is_suppressed
    verify_harness::worksheet_block_normal_then_insert_again
    verify_harness::worksheet_compose_visibility_tracks_block_and_turn
    verify_harness::worksheet_cursor_on_existing_block_resumes_it
    verify_harness::worksheet_inline_typing_rerenders_transcript
    verify_harness::worksheet_insert_opens_and_empty_esc_discards_you_block
    verify_harness::worksheet_multiple_insertion_points
    verify_harness::worksheet_nonempty_you_block_persists_after_esc
    verify_harness::worksheet_reentering_insert_keeps_block_anchor

test result: FAILED. 294 passed; 16 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.13s

*** result: Failure(101)
