*** src/bin/yalda-gpui/main.rs:3611:9: replace YaldaGpuiView::try_start_mark_chord -> bool with false

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ replace YaldaGpuiView::try_start_mark_chord -> bool with false
@@ -3603,32 +3603,17 @@
     /// Check if a bare key press starts a mark chord (`m` or `'`).
     /// Returns true if the key was consumed.
     fn try_start_mark_chord(
         &mut self,
         key: &Key,
         modifiers: &KMods,
         cx: &mut Context<Self>,
     ) -> bool {
-        if !modifiers.is_empty() {
-            return false;
-        }
-        match key {
-            Key::Char('m') => {
-                self.pending_mark_chord = Some('m');
-                cx.notify();
-                true
-            }
-            Key::Char('\'') => {
-                self.pending_mark_chord = Some('\'');
-                cx.notify();
-                true
-            }
-            _ => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// `on_key_down` handler for the Doc view — intercepts bare `m`/`'` to
     /// start a mark chord.
     fn handle_doc_key(&mut self, ev: &KeyDownEvent, _w: &mut Window, cx: &mut Context<Self>) {
         let press = keystroke_to_keypress(&ev.keystroke);
 
         // Universal leaders: the doc view is never text entry, so `<space>`/`.`/

---- verify_harness::real_midturn_worksheet_m_types_not_marks stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::real_midturn_worksheet_m_types_not_marks' (163203379) panicked at src/bin/yalda-gpui/verify_harness.rs:5132:9:
assertion `left == right` failed: idle transcript nav: bare `m` starts a mark chord
  left: None
 right: Some('m')
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

failures:
    verify_harness::real_midturn_worksheet_m_types_not_marks

test result: FAILED. 309 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.20s

*** result: Failure(101)
