*** src/bin/yalda-gpui/main.rs:4314:54: replace == with != in YaldaGpuiView::focused_in_insert_mode

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ replace == with != in YaldaGpuiView::focused_in_insert_mode
@@ -4306,17 +4306,17 @@
                         // started a steer. Rule 7 (revised — runtime report: "the
                         // <space>/. leader menus don't work mid-turn"): with an EMPTY
                         // steering draft the worksheet is resting in nav, so the leaders
                         // MUST fire (open the menu); once the draft is non-empty the
                         // keystrokes belong to the chatbox so spaces stay spaces and the
                         // leaders are suppressed. Pinned by
                         // `real_midturn_worksheet_empty_draft_space_opens_menu` /
                         // `real_midturn_worksheet_typed_draft_space_is_suppressed`.
-                        let compose_insert = c.focus == AgentFocus::Compose
+                        let compose_insert = c.focus != /* ~ changed by cargo-mutants ~ */ AgentFocus::Compose
                             && c.input_surface.compose().mode == EditMode::Insert;
                         let midturn_steer = c.turn_phase.is_awaiting()
                             && !c.input_surface.is_chatbox()
                             && !c.input_surface.compose().text().trim().is_empty();
                         compose_insert || midturn_steer
                     })
                     .unwrap_or(false)
                 }

---- verify_harness::focused_in_insert_mode_tracks_compose_not_transcript stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::focused_in_insert_mode_tracks_compose_not_transcript' (163243234) panicked at src/bin/yalda-gpui/verify_harness.rs:4668:5:
compose in Insert ⇒ text entry ⇒ space types a space

---- verify_harness::real_midturn_worksheet_empty_draft_space_opens_menu stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::real_midturn_worksheet_empty_draft_space_opens_menu' (163243283) panicked at src/bin/yalda-gpui/verify_harness.rs:5177:9:
empty-draft mid-turn worksheet rests in nav ⇒ leaders active
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

failures:
    verify_harness::focused_in_insert_mode_tracks_compose_not_transcript
    verify_harness::real_midturn_worksheet_empty_draft_space_opens_menu

test result: FAILED. 308 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.25s

*** result: Failure(101)
