*** src/bin/yalda-gpui/main.rs:4318:32: delete ! in YaldaGpuiView::focused_in_insert_mode

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ delete ! in YaldaGpuiView::focused_in_insert_mode
@@ -4310,17 +4310,17 @@
                         // keystrokes belong to the chatbox so spaces stay spaces and the
                         // leaders are suppressed. Pinned by
                         // `real_midturn_worksheet_empty_draft_space_opens_menu` /
                         // `real_midturn_worksheet_typed_draft_space_is_suppressed`.
                         let compose_insert = c.focus == AgentFocus::Compose
                             && c.input_surface.compose().mode == EditMode::Insert;
                         let midturn_steer = c.turn_phase.is_awaiting()
                             && !c.input_surface.is_chatbox()
-                            && !c.input_surface.compose().text().trim().is_empty();
+                            &&  /* ~ changed by cargo-mutants ~ */c.input_surface.compose().text().trim().is_empty();
                         compose_insert || midturn_steer
                     })
                     .unwrap_or(false)
                 }
             }
             Some(App::Linear(tile)) => {
                 let picker = tile
                     .view

---- verify_harness::real_midturn_worksheet_typed_draft_space_is_suppressed stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::real_midturn_worksheet_typed_draft_space_is_suppressed' (163265731) panicked at src/bin/yalda-gpui/verify_harness.rs:5209:9:
non-empty steer ⇒ text entry ⇒ leaders suppressed
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

---- verify_harness::real_midturn_worksheet_empty_draft_space_opens_menu stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::real_midturn_worksheet_empty_draft_space_opens_menu' (163265729) panicked at src/bin/yalda-gpui/verify_harness.rs:5177:9:
empty-draft mid-turn worksheet rests in nav ⇒ leaders active
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

---- verify_harness::worksheet_midturn_space_types_into_chatbox stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::worksheet_midturn_space_types_into_chatbox' (163265820) panicked at src/bin/yalda-gpui/verify_harness.rs:6055:9:
assertion `left == right` failed: space must type into the mid-turn chatbox, not fire the leader menu
  left: "ab"
 right: "a b"
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

failures:
    verify_harness::real_midturn_worksheet_empty_draft_space_opens_menu
    verify_harness::real_midturn_worksheet_typed_draft_space_is_suppressed
    verify_harness::worksheet_midturn_space_types_into_chatbox

test result: FAILED. 307 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.18s

*** result: Failure(101)
