*** src/bin/yalda-gpui/main.rs:4330:17: delete ! in YaldaGpuiView::focused_in_insert_mode

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ delete ! in YaldaGpuiView::focused_in_insert_mode
@@ -4322,17 +4322,17 @@
                 }
             }
             Some(App::Linear(tile)) => {
                 let picker = tile
                     .view
                     .as_ref()
                     .map(|v| v.read(cx).is_picker())
                     .unwrap_or(false);
-                !picker && tile.mode == LinearMode::Insert
+                 /* ~ changed by cargo-mutants ~ */picker && tile.mode == LinearMode::Insert
             }
             Some(App::Buffer(BufferApp::Viewing(_))) | None => false,
         }
     }
 
     /// Universal leader dispatch: when the focused tile is NOT in text entry, the
     /// bare leader keys open their menus with TOP priority, before any
     /// tile-specific key handling. Returns true if it consumed the key (the

---- verify_harness::leader_intercept_respects_insert_mode stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::leader_intercept_respects_insert_mode' (163278778) panicked at src/bin/yalda-gpui/verify_harness.rs:4611:5:
in Insert mode a leader is left to the tile as text

failures:
    verify_harness::leader_intercept_respects_insert_mode

test result: FAILED. 309 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.18s

*** result: Failure(101)
