*** src/bin/yalda-gpui/main.rs:3545:12: delete ! in YaldaGpuiView::try_start_mark_chord

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ delete ! in YaldaGpuiView::try_start_mark_chord
@@ -3537,17 +3537,17 @@
     /// Check if a bare key press starts a mark chord (`m` or `'`).
     /// Returns true if the key was consumed.
     fn try_start_mark_chord(
         &mut self,
         key: &Key,
         modifiers: &KMods,
         cx: &mut Context<Self>,
     ) -> bool {
-        if !modifiers.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */modifiers.is_empty() {
             return false;
         }
         match key {
             Key::Char('m') => {
                 self.pending_mark_chord = Some('m');
                 cx.notify();
                 true
             }

---- verify_harness::real_midturn_worksheet_m_types_not_marks stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::real_midturn_worksheet_m_types_not_marks' (162876508) panicked at src/bin/yalda-gpui/verify_harness.rs:4928:9:
assertion `left == right` failed: idle transcript nav: bare `m` starts a mark chord
  left: None
 right: Some('m')
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

failures:
    verify_harness::real_midturn_worksheet_m_types_not_marks

test result: FAILED. 296 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.56s

*** result: Failure(101)
