*** src/bin/yalda-gpui/main.rs:4242:54: replace == with != in YaldaGpuiView::focused_in_insert_mode

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ replace == with != in YaldaGpuiView::focused_in_insert_mode
@@ -4234,17 +4234,17 @@
                     // normal dispatch, opening the workspace menu instead of the
                     // tile menu.
                     self.agent_read(cx, |c| {
                         // Focused compose in Insert is text entry. ALSO: mid-turn in
                         // the worksheet, input routes to the bottom chatbox even
                         // though focus stays on the transcript — so that is text
                         // entry too, and the leaders (space/./?) must NOT fire (else a
                         // space mid-turn opens a menu — INV-UX-9 rule 7).
-                        let compose_insert = c.focus == AgentFocus::Compose
+                        let compose_insert = c.focus != /* ~ changed by cargo-mutants ~ */ AgentFocus::Compose
                             && c.input_surface.compose().mode == EditMode::Insert;
                         let midturn_worksheet =
                             c.turn_phase.is_awaiting() && !c.input_surface.is_chatbox();
                         compose_insert || midturn_worksheet
                     })
                     .unwrap_or(false)
                 }
             }

---- verify_harness::focused_in_insert_mode_tracks_compose_not_transcript stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::focused_in_insert_mode_tracks_compose_not_transcript' (162910847) panicked at src/bin/yalda-gpui/verify_harness.rs:4464:5:
compose in Insert ⇒ text entry ⇒ space types a space

failures:
    verify_harness::focused_in_insert_mode_tracks_compose_not_transcript

test result: FAILED. 296 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.52s

*** result: Failure(101)
