*** src/bin/yalda-gpui/main.rs:4245:59: delete ! in YaldaGpuiView::focused_in_insert_mode

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ delete ! in YaldaGpuiView::focused_in_insert_mode
@@ -4237,17 +4237,17 @@
                         // Focused compose in Insert is text entry. ALSO: mid-turn in
                         // the worksheet, input routes to the bottom chatbox even
                         // though focus stays on the transcript — so that is text
                         // entry too, and the leaders (space/./?) must NOT fire (else a
                         // space mid-turn opens a menu — INV-UX-9 rule 7).
                         let compose_insert = c.focus == AgentFocus::Compose
                             && c.input_surface.compose().mode == EditMode::Insert;
                         let midturn_worksheet =
-                            c.turn_phase.is_awaiting() && !c.input_surface.is_chatbox();
+                            c.turn_phase.is_awaiting() &&  /* ~ changed by cargo-mutants ~ */c.input_surface.is_chatbox();
                         compose_insert || midturn_worksheet
                     })
                     .unwrap_or(false)
                 }
             }
             Some(App::Linear(tile)) => {
                 let picker = tile
                     .view

---- verify_harness::real_midturn_worksheet_space_is_suppressed_on_main stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::real_midturn_worksheet_space_is_suppressed_on_main' (162923816) panicked at src/bin/yalda-gpui/verify_harness.rs:4967:9:
rule 7: mid-turn worksheet counts as text entry ⇒ leaders suppressed
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

---- verify_harness::worksheet_midturn_space_types_into_chatbox stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::worksheet_midturn_space_types_into_chatbox' (162923905) panicked at src/bin/yalda-gpui/verify_harness.rs:5796:9:
assertion `left == right` failed: space must type into the mid-turn chatbox, not fire the leader menu
  left: "ab"
 right: "a b"
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

failures:
    verify_harness::real_midturn_worksheet_space_is_suppressed_on_main
    verify_harness::worksheet_midturn_space_types_into_chatbox

test result: FAILED. 295 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.51s

*** result: Failure(101)
