*** src/bin/yalda-gpui/main.rs:4246:40: replace || with && in YaldaGpuiView::focused_in_insert_mode

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ replace || with && in YaldaGpuiView::focused_in_insert_mode
@@ -4238,17 +4238,17 @@
                         // the worksheet, input routes to the bottom chatbox even
                         // though focus stays on the transcript — so that is text
                         // entry too, and the leaders (space/./?) must NOT fire (else a
                         // space mid-turn opens a menu — INV-UX-9 rule 7).
                         let compose_insert = c.focus == AgentFocus::Compose
                             && c.input_surface.compose().mode == EditMode::Insert;
                         let midturn_worksheet =
                             c.turn_phase.is_awaiting() && !c.input_surface.is_chatbox();
-                        compose_insert || midturn_worksheet
+                        compose_insert && /* ~ changed by cargo-mutants ~ */ midturn_worksheet
                     })
                     .unwrap_or(false)
                 }
             }
             Some(App::Linear(tile)) => {
                 let picker = tile
                     .view
                     .as_ref()

---- verify_harness::focused_in_insert_mode_tracks_compose_not_transcript stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::focused_in_insert_mode_tracks_compose_not_transcript' (162928138) panicked at src/bin/yalda-gpui/verify_harness.rs:4464:5:
compose in Insert ⇒ text entry ⇒ space types a space

---- verify_harness::real_midturn_worksheet_space_is_suppressed_on_main stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::real_midturn_worksheet_space_is_suppressed_on_main' (162928183) panicked at src/bin/yalda-gpui/verify_harness.rs:4967:9:
rule 7: mid-turn worksheet counts as text entry ⇒ leaders suppressed
[yalda-gpui] session-client reader exiting — server closed connection (EOF)

---- verify_harness::worksheet_midturn_space_types_into_chatbox stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::worksheet_midturn_space_types_into_chatbox' (162928272) panicked at src/bin/yalda-gpui/verify_harness.rs:5796:9:
assertion `left == right` failed: space must type into the mid-turn chatbox, not fire the leader menu
  left: "ab"
 right: "a b"

failures:
    verify_harness::focused_in_insert_mode_tracks_compose_not_transcript
    verify_harness::real_midturn_worksheet_space_is_suppressed_on_main
    verify_harness::worksheet_midturn_space_types_into_chatbox

test result: FAILED. 294 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.50s

*** result: Failure(101)
