*** src/bin/yalda-gpui/main.rs:4257:25: replace && with || in YaldaGpuiView::focused_in_insert_mode

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ replace && with || in YaldaGpuiView::focused_in_insert_mode
@@ -4249,17 +4249,17 @@
                 }
             }
             Some(App::Linear(tile)) => {
                 let picker = tile
                     .view
                     .as_ref()
                     .map(|v| v.read(cx).is_picker())
                     .unwrap_or(false);
-                !picker && tile.mode == LinearMode::Insert
+                !picker || /* ~ changed by cargo-mutants ~ */ tile.mode == LinearMode::Insert
             }
             Some(App::Buffer(BufferApp::Viewing(_))) | None => false,
         }
     }
 
     /// Universal leader dispatch: when the focused tile is NOT in text entry, the
     /// bare leader keys open their menus with TOP priority, before any
     /// tile-specific key handling. Returns true if it consumed the key (the

---- verify_harness::leader_intercept_respects_insert_mode stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::leader_intercept_respects_insert_mode' (162932571) panicked at src/bin/yalda-gpui/verify_harness.rs:4414:5:
in Normal mode a leader is intercepted as a menu-opener

---- verify_harness::linear_normal_mode_frees_keys_for_menus stdout ----
[yalda-gpui] connected to session server

thread 'verify_harness::linear_normal_mode_frees_keys_for_menus' (162932574) panicked at src/bin/yalda-gpui/verify_harness.rs:4382:5:
`<space>` is consumed as a leader in Normal mode

failures:
    verify_harness::leader_intercept_respects_insert_mode
    verify_harness::linear_normal_mode_frees_keys_for_menus

test result: FAILED. 295 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 1.52s

*** result: Failure(101)
