*** src/bin/yalda-gpui/main.rs:7197:21: delete field titlebar from struct WindowOptions expression in main

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ delete field titlebar from struct WindowOptions expression in main
@@ -7189,20 +7189,17 @@
         let window_handle = app
             .open_window(
                 WindowOptions {
                     window_bounds: Some(WindowBounds::Windowed(bounds)),
                     // Titled window so the standard system title bar (with
                     // close/minimize/maximize buttons AND the resize affordance
                     // that comes with it) is rendered. Previously `None` →
                     // chromeless window that couldn't be resized.
-                    titlebar: Some(TitlebarOptions {
-                        title: Some("Yaldabaoth".into()),
-                        ..Default::default()
-                    }),
+                     /* ~ changed by cargo-mutants ~ */
                     ..Default::default()
                 },
                 move |window, app| {
                     app.new(|cx| {
                         let focus_handle = cx.focus_handle();
                         focus_handle.focus(window);
                         let mut view = match initial_doc.clone() {
                             Some((blocks, canon, path)) => {

*** result: Success
