*** src/bin/yalda-gpui/main.rs:7198:25: delete field title from struct TitlebarOptions expression in main

*** mutation diff:
--- src/bin/yalda-gpui/main.rs
+++ delete field title from struct TitlebarOptions expression in main
@@ -7190,17 +7190,17 @@
             .open_window(
                 WindowOptions {
                     window_bounds: Some(WindowBounds::Windowed(bounds)),
                     // Titled window so the standard system title bar (with
                     // close/minimize/maximize buttons AND the resize affordance
                     // that comes with it) is rendered. Previously `None` →
                     // chromeless window that couldn't be resized.
                     titlebar: Some(TitlebarOptions {
-                        title: Some("Yaldabaoth".into()),
+                         /* ~ changed by cargo-mutants ~ */
                         ..Default::default()
                     }),
                     ..Default::default()
                 },
                 move |window, app| {
                     app.new(|cx| {
                         let focus_handle = cx.focus_handle();
                         focus_handle.focus(window);

*** result: Success
